In [18]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
dataset = pd.read_csv('IMDB-Movie-Data.csv')
dataset.head()

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [4]:
dataset['Rating'].mean()

6.723199999999999

In [5]:
dataset['Rating'].median()

6.8

In [6]:
dataset['Rating'].mode()

0    7.1
dtype: float64

In [10]:
dataset['Rating'].std()

0.9454287892779634

In [13]:
dataset.groupby(['Year']).mean()

,Rank,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Year,,,,,,
2006,588.500000,120.840909,7.125000,269289.954545,86.296667,64.414634
2007,576.584906,121.622642,7.133962,244331.037736,87.882245,64.500000
2008,625.634615,110.826923,6.784615,275505.384615,99.082745,57.408163
2009,586.823529,116.117647,6.960784,255780.647059,112.601277,57.122449
2010,587.316667,111.133333,6.826667,252782.316667,105.081579,59.389831
2011,589.571429,114.603175,6.838095,240790.301587,87.612258,61.724138
2012,532.875000,119.109375,6.925000,285226.093750,107.973281,61.145161
2013,556.230769,116.065934,6.812088,219049.648352,87.121818,58.534884
2014,512.979592,114.489796,6.837755,203930.224490,85.078723,57.315789
2015,491.393701,114.496063,6.602362,115726.220472,78.355044,57.040650
2016,376.444444,107.373737,6.436700,48591.754209,54.690976,58.283582

In [19]:
idf = sns.load_dataset('iris')

In [20]:
idf

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [21]:
idf.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [22]:
idf.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [24]:
idf.std()

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

In [28]:
np.percentile(idf['sepal_length'], 50)

5.8

In [ ]:
|